---
kind: other
id: Methods.T:Autodesk.Revit.DB.Part
source: html/7c85ab6d-4057-0db9-1ba3-b8eaffdd9f32.htm
---
# Part Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.